## 丸め誤差

```ruby
> 0.1 * 3.0
=> 0.30000000000000004
> 0.1 * 3.0 == 0.3
=> false
> 0.1r * 3.0r
=> (3/10)
> (0.1r * 3.0r).to_f
=> 0.3

```
