## 丸め誤差

```ruby
> 0.1 * 3.0
=> 0.30000000000000004
> 0.1 * 3.0 == 0.3
=> false
> 0.1r * 3.0r
=> (3/10)
> (0.1r * 3.0r).to_f
=> 0.3

```

## ヒアドキュメント

```ruby
> a = 'Ruby'
=> "Ruby"
-" a.prepend(<<TEXT)
-" JAVA
-" PHP
-" RUBY
> TEXT
=> "JAVA\nPHP\nRUBY\nRuby"
> puts a
JAVA
PHP
RUBY
Ruby
=> nil
```

```ruby
> b = <<TEXT.upcase
java
php
ruby
> TEXT
=> "JAVA\nPHP\nRUBY\n"
> puts b
JAVA
PHP
RUBY
=> nil
```

## sprintf

```ruby
> sprintf('%0.3f', 1.2)
=> "1.200"
> '%0.3f' % 1.2
=> "1.200"
> sprintf('%0.3f + %0.3f', 1.2, 0.48)
=> "1.200 + 0.480"
> '%0.3f + %0.3f' % [1.2, 0.48]
=> "1.200 + 0.480"
```

## \u

```ruby
> "\u3042\u3044\u3046"
=> "あいう"
```

## ?

```ruby
> ?a
=> "a"
```

## 整数リテラル

```ruby
> 0b11111111
=> 255
> 0377
=> 255
> 0xff
=> 255
> 2e-3
=> 0.002
```

## 評価

```ruby
> 1 && 2 && 3
=> 3
> 1 && nil && 3
=> nil
> 1 && false && 3
=> false
> nil || false
=> false
> false || nil
=> nil
> nil || false || 2 || 3
=> 2
```
