## divmod

```ruby
> 14.divmod(3)
=> [4, 2]
```

## delete_id

```ruby
> a = [1, 2, 3, 4, 1, 2, 3]
=> [1, 2, 3, 4, 1, 2, 3]
> a.delete_if do |n|
>   n.odd?
> end
=> [2, 4, 2]

## 範囲

```ruby
> (1..5).include?(4.9)
=> true
```

## 配列

```ruby

> (1..4).to_a
=> [1, 2, 3, 4]
> [*1..4]
=> [1, 2, 3, 4]
n = *(1..4)
=> [1, 2, 3, 4]
```

